#!/usr/bin/env python
# coding:utf-8

"""
20. 有效的括号
难度
简单

给定一个只包括 '('，')'，'{'，'}'，'['，']' 的字符串，判断字符串是否有效。

有效字符串需满足：

左括号必须用相同类型的右括号闭合。
左括号必须以正确的顺序闭合。
注意空字符串可被认为是有效字符串。

示例 1:

输入: "()"
输出: true
示例 2:

输入: "()[]{}"
输出: true
示例 3:

输入: "(]"
输出: false
示例 4:

输入: "([)]"
输出: false
示例 5:

输入: "{[]}"
输出: true
"""
# ================================================================================
"""
思路:
    
时间复杂度:
    O()
空间复杂度: 
    O()
"""


class Solution(object):
    def isValid(self, s):
        """
        :type s: str
        :rtype: bool
        """
        stack = []
        d = {
            ')': '(',
            ']': '[',
            '}': '{',
        }
        for x in s:
            if x in d.values():
                stack.append(x)
                pass
            if x in d.keys():
                if stack and stack[-1] == d[x]:
                    stack.pop()
                    pass
                else:
                    return False
                pass
            pass
        return not stack

# ================================================================================
# ================================================================================
# ================================================================================
# ================================================================================
# ================================================================================
