#!/usr/bin/env python
# coding:utf-8

"""
322. 零钱兑换
难度
中等

给定不同面额的硬币 coins 和一个总金额 amount。编写一个函数来计算可以凑成总金额所需的最少的硬币个数。如果没有任何一种硬币组合能组成总金额，返回 -1。

示例 1:

输入: coins = [1, 2, 5], amount = 11
输出: 3
解释: 11 = 5 + 5 + 1
示例 2:

输入: coins = [2], amount = 3
输出: -1
说明:
你可以认为每种硬币的数量是无限的。


"""
# ================================================================================
"""
思路:
    
时间复杂度:
    O()
空间复杂度: 
    O()
"""


class Solution(object):
    def coinChange(self, coins, amount):
        """
        :type coins: List[int]
        :type amount: int
        :rtype: int
        """

# ================================================================================
# ================================================================================
# ================================================================================
# ================================================================================
# ================================================================================
