#!/usr/bin/env python
# coding:utf-8

"""
X*Y的网格迷宫

有一个X*Y的网格，小团要在此网格上从左上角到右下角，只能走格点且只能向右或向下走。
请设计一个算法，计算小团有多少种走法。给定两个正整数int x,int y，请返回小团的走法数目。

输入描述:
输入包括一行，逗号隔开的两个正整数x和y，取值范围[1,10]。

输出描述:
输出包括一行，为走法的数目。
"""
# ================================================================================
"""
思路:
    
时间复杂度:
    O()
空间复杂度: 
    O()
"""


def grid_maze(x, y):
    dp = [[0] * (y+1)] * (x+1)
    print dp
    for i in range(1, x+1):
        for j in range(1, y+1):
            if i == j == 1:
                dp[i][j] = 1
            else:
                dp[i][j] = dp[i-1][j] + dp[i][j-1]
                pass
            pass
        pass
    print dp
    return dp[-1][-1]


print grid_maze(4, 3)
# 10
# ================================================================================
# ================================================================================
# ================================================================================
# ================================================================================
# ================================================================================
